["LinkedIn Workforce Report: January and February were the strongest consecutive months for hiring since August and September 2015","On International Women's Day, join me in honoring the critical role of women here in America &amp; around the world.","I have tremendous respect for women and the many roles they serve that are vital to the fabric of our society and our economy.","I feel sure that my friend @RandPaul will come along with the new and great health care program because he knows Obamacare is a disaster!","Don't let the FAKE NEWS tell you that there is big infighting in the Trump Admin. We are getting along great, and getting major things done!","I am working on a new system where there will be competition in the Drug Industry. Pricing for the American people will come way down!","Don't worry, getting rid of state lines, which will promote competition, will be in phase 2 &amp; 3 of healthcare rollout. @foxandfriends","For eight years Russia \"ran over\" President Obama, got stronger and stronger, picked-off Crimea and added missiles. Weak! @foxandfriends","Our wonderful new Healthcare Bill is now out for review and negotiation. ObamaCare is a complete and total disaster - is imploding fast!","122 vicious prisoners, released by the Obama Administration from Gitmo, have returned to the battlefield. Just another terrible decision!","Thank you to @exxonmobil for your $20 billion investment that is creating more than 45,000 manufacturing &amp; construction jobs in the USA!","Buy American &amp; hire American are the principles at the core of my agenda, which is: JOBS, JOBS, JOBS! Thank you @exxonmobil.","There is an incredible spirit of optimism sweeping the country right now—we're bringing back the JOBS! https://t.co/BNSLvKiEVj","45,000 construction &amp; manufacturing jobs in the U.S. Gulf Coast region. $20 billion investment. We are already winning again, America!","Buy American &amp; hire American are the principals at the core of my agenda, which is: JOBS, JOBS, JOBS! Thank you @exxonmobil.","'President Trump Congratulates Exxon Mobil for Job-Creating Investment Program'\nhttps://t.co/adBzWhtq8S","Thank you for the great rallies all across the country. Tremendous support. Make America Great Again!","Who was it that secretly said to Russian President, \"Tell Vladimir that after the election I'll have more flexibility?\" @foxandfriends","Is it true the DNC would not allow the FBI access to check server or other equipment after learning it was hacked? Can that be possible?","Arnold Schwarzenegger isn't voluntarily leaving the Apprentice, he was fired by his bad (pathetic) ratings, not by me. Sad end to great show","How low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy!","I'd bet a good lawyer could make a great case out of the fact that President Obama was tapping my phones in October, just prior to Election!","Is it legal for a sitting President to be \"wire tapping\" a race for president prior to an election? Turned down by court earlier. A NEW LOW!","Just out: The same Russian Ambassador that met Jeff Sessions visited the Obama White House 22 times, and 4 times last year alone.","Terrible! Just found out that Obama had my \"wires tapped\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!","The first meeting Jeff Sessions had with the Russian Amb was set up by the Obama Administration under education program for 100 Ambs......","MAKE AMERICA GREAT AGAIN! https://t.co/kuQiZDz4rA","I hereby demand a second investigation, after Schumer, of Pelosi for her close ties to Russia, and lying about it. https://t.co/qCDljfF3wN","I hearby demand a second investigation, after Schumer, of Pelosi for her close ties to Russia, and lying about it. https://t.co/qCDljfF3wN","We must fix our education system for our kids to Make America Great Again. Wonderful day at Saint Andrew in Orlando. https://t.co/OTJaHcvLzf","I hear by demand a second investigation, after Schumer, of Pelosi for her close ties to Russia, and lying about it. https://t.co/qCDljfF3wN","We should start an immediate investigation into @SenSchumer and his ties to Russia and Putin. A total hypocrite! https://t.co/Ik3yqjHzsA","Weekly Address\nJoin me here: https://t.co/SEavQK5zy5 https://t.co/EnyXYeqgcp","It is so pathetic that the Dems have still not approved my full Cabinet.","Nick Adams new book, Green Card Warrior, is a must read. The merit-based system is the way to go. Canada, Australia! @foxandfriends","...is all of the illegal leaks of classified and other information. It is a total \"witch hunt!\"","...to win. The Democrats are overplaying their hand. They lost the election, and now they have lost their grip on reality. The real story...","...intentional. This whole narrative is a way of saving face for Democrats losing an election that everyone thought they were supposed.....","Jeff Sessions is an honest man. He did not say anything wrong. He could have stated his response more accurately, but it was clearly not....","Since November 8th, Election Day, the Stock Market has posted $3.2 trillion in GAINS and consumer confidence is at a 15 year high. Jobs!","THANK YOU!","#JointSession #MAGA🇺🇸\nhttps://t.co/RDO6Jt2pip","Join me live at 9:00 P.M. \n#JointAddress https://t.co/J882zbyVkJ https://t.co/gTtK3vJmkU","I will be interviewed on @foxandfriends at 6:00 A.M. Enjoy!","GOP now viewed more favorably than Dems, in Trump era (per NBC/WSJ poll) via @HotlineJosh:\nhttps://t.co/Soebxtg2Zd","Great meeting with CEOs of leading U.S. health insurance companies who provide great healthcare to the American peo… https://t.co/60jigi6ffS","Big dinner with Governors tonight at White House. Much to be discussed, including healthcare.","Russia talk is FAKE NEWS put out by the Dems, and played up by the media, in order to mask the big election defeat and the illegal leaks!","For first time the failing @nytimes will take an ad (a bad one) to help save its failing reputation. Try reporting accurately &amp; fairly!","The race for DNC Chairman was, of course, totally \"rigged.\" Bernie's guy, like Bernie himself, never had a chance. Clinton demanded Perez!","Congratulations to Thomas Perez, who has just been named Chairman of the DNC. I could not be happier for him, or for the Republican Party!","I will not be attending the White House Correspondents' Association Dinner this year. Please wish everyone well and have a great evening!","Weekly Address from @WhiteHouse: https://t.co/uaoQSHBOQB https://t.co/7eF6aC6kEC","Great optimism for future of U.S. business, AND JOBS, with the DOW having an 11th straight record close. Big tax &amp; regulation cuts coming!","The media has not reported that the National Debt in my first month went down by $12 billion vs a $200 billion increase in Obama first mo.","Maybe the millions of people who voted to MAKE AMERICA GREAT AGAIN should have their own rally. It would be the biggest of them all!","FAKE NEWS media knowingly doesn't tell the truth. A great danger to our country. The failing @nytimes has become a joke. Likewise @CNN. Sad!","Trump vows to fight 'epidemic' of human trafficking \nhttps://t.co/oDLZ2NdrtA","Going to CPAC!","find the leakers within the FBI itself. Classified information is being given to media that could have a devastating effect on U.S. FIND NOW","The FBI is totally unable to stop the national security \"leakers\" that have permeated our government for a long time. They can't even......","Big interview tonight by Henry Kravis at The Business Council of Washington. Looking forward to it!","Seven people shot and killed yesterday in Chicago. What is going on there - totally out of control. Chicago needs help!","'S&amp;P 500 Edges Higher After Trump Renews Jobs Pledge' https://t.co/WtrRJVFmvU","Very much enjoyed my tour of the Smithsonian's National Museum of African American History and Culture...A great job done by amazing people!","One thing I will say about Rep. Keith Ellison, in his fight to lead the DNC, is that he was the one who predicted early that I would win!","The so-called angry crowds in home districts of some Republicans are actually, in numerous cases, planned out by liberal activists. Sad!","'Americans overwhelmingly oppose sanctuary cities' https://t.co/s5QvsJWA6u","Congratulations to our new National Security Advisor, General H.R. McMaster. Video: https://t.co/BKn9r225Kk https://t.co/VBXcJ1b6Pv","Just named General H.R. McMaster National Security Advisor.","Meeting with Generals at Mar-a-Lago in Florida. Very interesting!","HAPPY PRESIDENTS DAY - MAKE AMERICA GREAT AGAIN!","Give the public a break - The FAKE NEWS media is trying to say that large scale immigration in Sweden is working out just beautifully. NOT!","My statement as to what's happening in Sweden was in reference to a story that was broadcast on @FoxNews concerning immigrants &amp; Sweden.","Getting ready to leave for Melbourne, Florida. See you all soon!","Will be having many meetings this weekend at The Southern White House. Big 5:00 P.M. speech in Melbourne, Florida. A lot to talk about!","Don't believe the main stream (fake news) media.The White House is running VERY WELL. I inherited a MESS and am in the process of fixing it.","Looking forward to the Florida rally tomorrow. Big crowd expected!","\"One of the most effective press conferences I've ever seen!\" says Rush Limbaugh. Many agree.Yet FAKE MEDIA  calls it differently! Dishonest","The FAKE NEWS media (failing @nytimes, @NBCNews, @ABC, @CBS, @CNN) is not my enemy, it is the enemy of the American People!","The FAKE NEWS media (failing @nytimes, @CNN, @NBCNews and many more)    is not my enemy, it is the enemy of the American people. SICK!","Join me at 11:00am:\nWatch here: https://t.co/veqKmsGAwf https://t.co/UzndIjIqjM","General Keith Kellogg, who I have known for a long time, is very much in play for NSA - as are three others.","Thank you for all of the nice statements on the Press Conference yesterday. Rush Limbaugh said one of greatest ever. Fake media not happy!","Going to Charleston, South Carolina, in order to spend time with Boeing and talk jobs! Look forward to it.","Despite the long delays by the Democrats in finally approving Dr. Tom Price, the repeal and replacement of ObamaCare is moving fast!","'Trump signs bill undoing Obama coal mining rule' https://t.co/yMfT5r5RGh","The Democrats had to come up with a story as to why they lost the election, and so badly (306), so they made up a story - RUSSIA. Fake news!","FAKE NEWS media, which makes up stories and \"sources,\" is far more effective than the discredited Democrats - but they are fading fast!","The spotlight has finally been put on the low-life leakers! They will be caught!","Leaking, and even illegal classified leaking, has been a big problem in Washington for years. Failing @nytimes (and others) must apologize!","Stock market hits new high with longest winning streak in decades. Great level of confidence and optimism - even before tax plan rollout!","Venezuela should allow Leopoldo Lopez, a political prisoner &amp; husband of @liliantintori (just met w/ @marcorubio) o… https://t.co/HhgE51dtSN","Aetna CEO: Obamacare in 'Death Spiral' #RepealAndReplace \nhttps://t.co/dmHL7xIEQv","Join me in Florida this Saturday at 5pm for a rally at the Orlando-Melbourne International Airport!\nTickets:… https://t.co/OigfXFECPp","Welcome to the United States, @IsraeliPM Benjamin &amp; Sara!\n#ICYMI🇺🇸🇮🇱Joint Press Conference: \nhttps://t.co/GN6ALWUusN https://t.co/bH60nBL5FP","Great listening session with CEO's of the Retail Industry Leaders Association this morning! https://t.co/sy6xJcWfcF","The real scandal here is that classified information is illegally given out by \"intelligence\" like candy. Very un-American!","Crimea was TAKEN by Russia during the Obama Administration. Was Obama too soft on Russia?","Thank you to Eli Lake of The Bloomberg View - \"The NSA &amp; FBI...should not interfere in our politics...and is\" Very serious situation for USA","Information is being illegally given to the failing @nytimes &amp; @washingtonpost by the intelligence community (NSA and FBI?).Just like Russia","This Russian connection non-sense is merely an attempt to cover-up the many mistakes made in Hillary Clinton's losing campaign.","The fake news media is going crazy with their conspiracy theories and blind hatred. @MSNBC &amp; @CNN are unwatchable. @foxandfriends is great!","Obamacare continues to fail. Humana to pull out in 2018. Will repeal, replace &amp; save healthcare for ALL Americans. \nhttps://t.co/glWEQ0lNR4","'Remarks by President Trump at Signing of H.J. Resolution 41'\nhttps://t.co/Q3MoCGAc54 https://t.co/yGDDTKm9Br","Great parent-teacher listening session this morning with @VP Pence &amp; @usedgov Secretary @BetsyDeVos. Watch:… https://t.co/nuLTs513Ot","The real story here is why are there so many illegal leaks coming out of Washington? Will these leaks be happening as I deal on N.Korea etc?","Congratulations to our new #VASecretary Dr. David Shulkin. Time to take care of Veterans who have fought to protect… https://t.co/FNewjbHuw4","Congratulations Treasury Secretary Steven Mnuchin! #ICYMI- watch here: https://t.co/RPsmw4yD7y https://t.co/K8tWLlXiYK","Wonderful meeting with Canadian PM @JustinTrudeau and a group of leading CEO's &amp; business women from Canada🇨🇦and th… https://t.co/wAoCOaYeZ6","Welcome to the @WhiteHouse Prime Minister @JustinTrudeau! https://t.co/WKgF8Zo9ri","Today I will meet with Canadian PM Trudeau and a group of leading business women to discuss women in the workforce. https://t.co/bFAHPRXHdP","Just leaving Florida. Big crowds of enthusiastic supporters lining the road that the FAKE NEWS media refuses to mention. Very dishonest!","Congratulations Stephen Miller- on representing me this morning on the various Sunday morning shows. Great job!","I know Mark Cuban well. He backed me big-time but I wasn't interested in taking all of his calls.He's not smart enough to run for president!","After two days of very productive talks, Prime Minister Abe is heading back to Japan. L","While on FAKE NEWS @CNN, Bernie Sanders was cut off for using the term fake news to describe the network. They said technical difficulties!","72% of refugees admitted into U.S. (2/3 -2/11) during COURT BREAKDOWN are from 7 countries: SYRIA, IRAQ, SOMALIA, IRAN, SUDAN, LIBYA &amp; YEMEN","The crackdown on illegal criminals is merely the keeping of my campaign promise. Gang members, drug dealers &amp; others are being removed!","#ICYMI: Joint Statement with Prime Minister Shinzo Abe on North Korea. https://t.co/qEC87FKB1D","RT @Scavino45: LIVE Joint Statement by President Trump and Prime Minister Shinzo Abe: https://t.co/c3Fe5cUaaS","A working dinner tonight with Prime Minister Abe of Japan, and his representatives, at the Winter White House (Mar-a-Lago). Very good talks!","Played golf today with Prime Minister Abe of Japan and @TheBig_Easy, Ernie Els, and had a great time. Japan is very well represented!","Playef golf today with Prime Minister Abe of Japan and @TheBig_Easy, Ernie Els, and had a great time. Japan is very well represented!","I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!","Having a great time hosting Prime Minister Shinzo Abe in the United States! \nhttps://t.co/Fvjsac89qS… https://t.co/hKqbMB2aQ9","Melania and I are hosting Japanese Prime Minister Shinzo Abe and Mrs. Abe at Mar-a-Lago in Palm Beach, Fla. They are a wonderful couple!","...design or negotiations yet. When I do, just like with the F-35 FighterJet or the Air Force One Program, price will come WAY DOWN!","I am reading that the great border WALL will cost more than the government originally thought, but I have not gotten involved in the.....","Our legal system is broken! \"77% of refugees allowed into U.S. since travel reprieve hail from seven suspect countries.\" (WT)  SO DANGEROUS!","Heading to Joint Base Andrews on #MarineOne with Prime Minister Shinzō earlier today. https://t.co/4JFhyYdeHO","The failing @nytimes does major FAKE NEWS China story saying \"Mr.Xi has not spoken to Mr. Trump since Nov.14.\" We spoke at length yesterday!","LAWFARE: \"Remarkably, in the entire opinion, the panel did not bother even to cite this (the) statute.\" A disgraceful decision!","SEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE!","Join us live in the Oval Office for the swearing in of our new Attorney General, @SenatorSessions!\nLIVE:… https://t.co/QeW6vjog4A","..Ryan died on a winning mission ( according to General Mattis), not a \"failure.\" Time for the U.S. to get smart and start winning again!","...long he doesn't know how to win anymore, just look at the mess our country is in - bogged down in conflict all over the place. Our hero..","Sen. McCain should not be talking about the success or failure of a mission to the media. Only emboldens the enemy! He's been losing so....","Chris Cuomo, in his interview with Sen. Blumenthal, never asked him about his long-term lie about his brave \"service\" in Vietnam. FAKE NEWS!","Sen.Richard Blumenthal, who never fought in Vietnam when he said for years he had (major lie),now misrepresents what Judge Gorsuch told him?","Congratulations to our new Attorney General, @SenatorSessions! https://t.co/e0buP1K83z","'Trump administration seen as more truthful than news media'\nhttps://t.co/6LmsR5JOSW","'Majority in Leading EU Nations Support Trump-Style Travel Ban' \nPoll of more than 10,000 people in 10 countries...https://t.co/KWsIWhtC9o","'Immigration Ban Is One Of Trump's Most Popular Orders So Far' https://t.co/wAelwuQ4BE","Thank you Brian Krzanich, CEO of @Intel. A great investment ($7 BILLION) in American INNOVATION and JOBS!… https://t.co/oicfDsPKHQ","Big increase in traffic into our country from certain areas, while our people are far more vulnerable, as we wait for what should be EASY D!","'16 Fake News Stories Reporters Have Run Since Trump Won' https://t.co/0dHld5kiVc","My daughter Ivanka has been treated so unfairly by @Nordstrom. She is a great person -- always pushing me to do the right thing! Terrible!","Thank you to our great Police Chiefs &amp; Sheriffs for your leadership &amp; service. You have a true friend in the… https://t.co/Lysnv8ZR1h","I will be speaking at 9:00 A.M. today to Police Chiefs and Sheriffs and will be discussing the horrible, dangerous and wrong decision.......","If the U.S. does not win this case as it so obviously should, we can never have the security and safety to which we are entitled. Politics!","It is a disgrace that my full Cabinet is still not in place, the longest such delay in the history of our country. Obstruction by Democrats!","An honor having the National Sheriffs' Assoc. join me at the @WhiteHouse. Incredible men &amp; women who protect &amp; serv… https://t.co/1LkhbCNh8L","I don't know Putin, have no deals in Russia, and the haters are going crazy - yet Obama can make a deal with Iran, #1 in terror, no problem!","I don't know Putin, have no deals in Russia, and the haters are going crazy - yet Obama can make a deal with Iran, #1in terror, no problem!","The threat from radical Islamic terrorism is very real, just look at what is happening in Europe and the Middle-East. Courts must act fast!","The failing @nytimes was forced to apologize to its subscribers for the poor reporting it did on my election win. Now they are worse!","An extended interview from the Super Bowl with @oreillyfactor airs tonight at 8:00 P.M. Enjoy! https://t.co/kZdHqaNTVR","The failing @nytimes writes total fiction concerning me. They have gotten it wrong for two years, and now are making up stories &amp; sources!","Will be interviewed on @oreillyfactor tonight at 8:00 P.M.","I call my own shots, largely based on an accumulation of data, and everyone knows it. Some FAKE NEWS media, in order to marginalize, lies!","Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting.","What an amazing comeback and win by the Patriots. Tom Brady, Bob Kraft and Coach B are total winners. Wow!","Enjoy the #SuperBowl and then we continue: MAKE AMERICA GREAT AGAIN!","I will be interviewed by @oreillyfactor at 4:00 P.M. (prior to the #SuperBowl Pre-game Show) on Fox Network. Enjoy!","I have instructed Homeland Security to check people coming into our country VERY CAREFULLY. The courts are making the job very difficult!","Just cannot  believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!","The judge opens up our country to potential terrorists and others that do not have our best interests at heart. Bad people are very happy!","Interview with @oreillyfactor on Fox Network - 4:00 P.M. (prior to Super Bowl). Enjoy!","Why aren't the lawyers looking at and using the Federal Court decision in Boston, which is at conflict with ridiculous lift ban decision?","Because the ban was lifted by a judge, many very bad and dangerous people may be pouring into our country. A terrible decision","What is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.?","MAKE AMERICA GREAT AGAIN!","After being forced to apologize for its bad and inaccurate coverage of me after winning the election, the FAKE NEWS @nytimes is still lost!","The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!","Interesting that certain Middle-Eastern countries agree with the ban. They know if certain people are allowed in it's death &amp; destruction!","When a country is no longer able to say who can, and who cannot , come in &amp; out, especially for reasons of safety &amp;.security - big trouble!","Countries charge U.S. companies taxes or tariffs while the U.S. charges them nothing or little.We should charge them SAME as they charge us!","We must keep \"evil\" out of our country!","A new radical Islamic terrorist has just attacked in Louvre Museum in Paris. Tourists were locked down. France on edge again. GET SMART U.S.","Professional anarchists, thugs and paid protesters are proving the point of the millions of people who voted to MAKE AMERICA GREAT AGAIN!","Meeting with biggest business leaders this morning. Good jobs are coming back to U.S., health care and tax bills are being crafted NOW!","Thank you to Prime Minister of Australia for telling the truth about our very civil conversation that FAKE NEWS media lied about. Very nice!","Iran is playing with fire - they don't appreciate how \"kind\" President Obama was to them. Not me!","Yes, Arnold Schwarzenegger did a really bad job as Governor of California and even worse on the Apprentice...but at least he tried hard!","Thank you, @Samsung! We would love to have you! https://t.co/r5nxC9oOA4","Iran was on its last legs and ready to collapse until the U.S. came along and gave it a life-line in the form of the Iran Deal: $150 billion","Iran has been formally PUT ON NOTICE for firing a ballistic missile.Should have been thankful for the terrible deal the U.S. made with them!","Attending Chief Ryan Owens' Dignified Transfer yesterday with my daughter Ivanka was my great honor. To a great and brave man - thank you!","Congratulations to Rex Tillerson on being sworn in as our new Secretary of State. He will be a star!","If U.C. Berkeley does not allow free speech and practices violence on innocent people with a different point of view - NO FEDERAL FUNDS?","Do you believe it? The Obama Administration agreed to take thousands of illegal immigrants from Australia. Why? I will study this dumb deal!","Iran is rapidly taking over more and more of Iraq even after the U.S. has squandered three trillion dollars there. Obvious long ago!","Everybody is arguing whether or not it is a BAN. Call it what you want, it is about keeping bad people (with bad intentions) out of country!","Hope you like my nomination of Judge Neil Gorsuch for the United States Supreme Court. He is a good and brilliant man, respected by all.","Join me live from the @WhiteHouse.\nhttps://t.co/LHOs4nAaGl","Getting ready to deliver a VERY IMPORTANT DECISION!  8:00 P.M.","When will the Democrats give us our Attorney General and rest of Cabinet! They should be ashamed of themselves! No wonder D.C. doesn't work!","Nancy Pelosi and Fake Tears Chuck Schumer held a rally  at the steps of The Supreme Court and mic did not work (a mess)-just like Dem party!","The Democrats are delaying my cabinet picks for purely political reasons. They have nothing going but to obstruct. Now have an Obama A.G.","The American dream is back. We’re going to create an environment for small business like we haven’t had in many, ma… https://t.co/Bh7SrNEgz1","Where was all the outrage from Democrats and the opposition party (the media) when our jobs were fleeing our country?","I have made my decision on who I will nominate for The United States Supreme Court. It will be announced live on Tuesday at 8:00 P.M. (W.H.)","If the ban were announced with a one week notice, the \"bad\" would rush into our country during that week. A lot of bad \"dudes\" out there!","There is nothing nice about searching for terrorists before they can enter our country. This was a big part of my campaign. Study the world!","protesters and the tears of Senator Schumer. Secretary Kelly said that all is going well with very few problems. MAKE AMERICA SAFE AGAIN!","Only 109 people out of 325,000 were detained and held for questioning. Big problems at airports were caused by Delta computer outage,.....","I will be interviewed by @TheBrodyFile on @CBNNews tonight at 11pm. Enjoy!","Statement Regarding Recent Executive Order Concerning Extreme Vetting: https://t.co/f6JO60I0Ul","...Senators should focus their energies on ISIS, illegal immigration and border security instead of always looking to start World War III.","The joint statement of former presidential candidates John McCain &amp; Lindsey Graham is wrong - they are sadly weak on immigration. The two...","Christians in the Middle-East have been executed in large numbers. We cannot allow this horror to continue!","Our country needs strong borders and extreme vetting, NOW. Look what is happening all over Europe and, indeed, the world - a horrible mess!","Somebody with aptitude and conviction should buy the FAKE NEWS and failing @nytimes and either run it correctly or let it fold with dignity!","I will be interviewed by @TheBrodyFile on @CBNNews tonight at 11pm. Enjoy!","Today, we remember the crew of the Space Shuttle Challenger, 31 years later. #NeverForget https://t.co/OhshQsFRfl","...dwindling subscribers and readers.They got me wrong right from the beginning and still have not changed course, and never will. DISHONEST","Thr coverage about me in the @nytimes and the @washingtonpost gas been so false and angry that the times actually apologized to its.....","The failing @nytimes has been wrong about me from the very beginning. Said I would lose the primaries, then the general election. FAKE NEWS!","I promise that our administration will ALWAYS have your back. We will ALWAYS be with you! https://t.co/D0aOWhOH4X","Congratulations Secretary Mattis! https://t.co/mkuhbegzqS","Statement on International Holocaust Remembrance Day: https://t.co/KjU0MOxCHk",".@VP Mike Pence will be speaking at today's #MarchForLife -- You have our full support! https://t.co/1jb53SEGV4","The #MarchForLife is so important. To all of you marching --- you have my full support!","Mexico has taken advantage of the U.S. for long enough. Massive trade deficits &amp; little help on the very weak border must change, NOW!","Look forward to seeing final results of VoteStand. Gregg Phillips and crew say at least 3,000,000 votes were illegal. We must do better!","Miami-Dade Mayor drops sanctuary policy. Right decision. Strong! https://t.co/MtPvaDC4jM","Will be interviewed by @SeanHannity on @FoxNews at 10:00pm tonight. Enjoy!","Spoke at the Congressional @GOP Retreat in Philadelphia, PA. this afternoon w/ @VP, @SenateMajLdr, @SpeakerRyan. Th… https://t.co/ALSADGrwoe","Spoke at the Congressional @GOP Retreat in Philadelphia, PA. this afternoon w/ @VP, @SenMajLeader, @SpeakerRyan. Th… https://t.co/s4sTbSyBSR","of jobs and companies lost. If Mexico is unwilling to pay for the badly needed wall, then it would be better to cancel the upcoming meeting.","The U.S. has a 60 billion dollar trade deficit with Mexico. It has been a one-sided deal from the beginning of NAFTA with massive numbers...","Ungrateful TRAITOR Chelsea Manning, who should never have been released from prison, is now calling President Obama a weak leader. Terrible!","Interview with David Muir of @ABC News in 10 minutes. Enjoy!","\"@romoabcnews: .@DavidMuir first @POTUS interview since taking office.  Tonight on @ABCWorldNews @ABC2020 tonight. https://t.co/I4Vz1mRdBK\"","As your President, I have no higher duty than to protect the lives of the American people. https://t.co/o7YNUNwb8f","Beginning today, the United States of America gets back control of its borders. Full speech from today @DHSgov:… https://t.co/8aDaHsAhg9","I will be interviewed by @DavidMuir tonight at 10 o'clock on @ABC. Will be my first interview from the White House.… https://t.co/4zuOrRdcoc","I will be making my Supreme Court pick on Thursday of next week.Thank you!","even, those registered to vote who are dead (and many for a long time). Depending on results, we will strengthen up voting procedures!","I will be asking for a major investigation into VOTER FRAUD, including those registered to vote in two states, those who are illegal and....","Big day planned on NATIONAL SECURITY tomorrow. Among many other things, we will build the wall!","If Chicago doesn't fix the horrible \"carnage\" going on, 228 shootings in 2017 with 42 killings (up 24% from 2016), I will send in the Feds!","Congratulations to @FoxNews for being number one in inauguration ratings. They were many times higher than FAKE NEWS @CNN - public is smart!","Great meeting with Ford CEO Mark Fields and General Motors CEO Mary Barra at the @WhiteHouse today. https://t.co/T0eIgO6LP8","Signing orders to move forward with the construction of the Keystone XL and Dakota Access pipelines in the Oval Off… https://t.co/aOxmfO0vOK","Great meeting with automobile industry leaders at the @WhiteHouse this morning. Together, we will #MAGA! https://t.co/OXdiLOkGsZ","A photo delivered yesterday that will be displayed in the upper/lower press hall. Thank you Abbas! https://t.co/Uzp0ivvRp0","Will be meeting at 9:00 with top automobile executives concerning jobs in America. I want new plants to be built here for cars sold here!","Busy week planned with a heavy focus on jobs and national security. Top executives coming in at 9:00 A.M. to talk manufacturing in America.","Peaceful protests are a hallmark of our democracy. Even if I don't always agree, I recognize the rights of people to express their views.","Wow, television ratings just out: 31 million people watched the Inauguration, 11 million more than the very good ratings from 4 years ago!","Watched protests yesterday but was under the impression that we just had an election! Why didn't these people vote? Celebs hurt cause badly.","Had a great meeting at CIA Headquarters yesterday, packed house, paid great respect to Wall, long standing ovations, amazing people. WIN!","RT @WhiteHouse: \"Do not allow anyone to tell you that it cannot be done. No challenge can match the HEART and FIGHT and SPIRIT of America.\"…","A fantastic day and evening in Washington D.C.Thank you to @FoxNews and so many other news outlets for the GREAT reviews of the speech!","THANK YOU for another wonderful evening in Washington, D.C. TOGETHER, we will MAKE AMERICA GREAT AGAIN🇺🇸 https://t.co/V3aoj9RUh4","TO ALL AMERICANS🇺🇸\nhttps://t.co/D7Es6ie4fY","So to all Americans, in every city near and far, small and large, from mountain to mountain...https://t.co/cZKkrGXLSi","It is time to remember that...https://t.co/ZKyOiOor62","We will follow two simple rules: BUY AMERICAN &amp; HIRE AMERICAN!\n#InaugurationDay #MAGA🇺🇸","We will bring back our jobs. We will bring back our borders. We will bring back our wealth - and we will bring back our dreams!","The forgotten men and women of our country will be forgotten no longer. From this moment on, it’s going to be #AmericaFirst🇺🇸","January 20th 2017, will be remembered as the day the people became the rulers of this nation again.","What truly matters is not which party controls our government, but whether our government is controlled by the people.","power from Washington, D.C. and giving it back to you, the American People. #InaugurationDay","Today we are not merely transferring power from one Administration to another, or from one party to another – but we are transferring...","It all begins today! I will see you at 11:00 A.M. for the swearing-in. THE MOVEMENT CONTINUES - THE WORK BEGINS!","Thank you for a wonderful evening in Washington, D.C. #Inauguration https://t.co/a6xpFQTHj5","Thank you for joining us at the Lincoln Memorial tonight- a very special evening! Together, we are going to MAKE AM… https://t.co/OSxa3BamHs","Join me at 4pm over at the Lincoln Memorial with my family!\n#Inauguration2017 https://t.co/GQeQpJOgWz","Great Concert at 4:00 P.M. today at Lincoln Memorial. Enjoy!","On my way! #Inauguration2017 https://t.co/hOuMbxGnpe","the American people. I have no doubt that we will, together, MAKE AMERICA GREAT AGAIN!","Getting ready to leave for Washington, D.C. The journey begins and I will be working and fighting very hard to make it a great journey for..","\"It wasn't Donald Trump that divided this country, this country has been divided for a long time!\" Stated today by Reverend Franklin Graham.","Thank you to our amazing Wounded Warriors for their service. It was an honor to be with them tonight in D.C.… https://t.co/Qj5cpfaykD","Great seeing @TheLeeGreenwood  and Kimberly at this evenings VP dinner! #GodBlessTheUSA https://t.co/SxVmaWvOFT","Looking forward to a speedy recovery for George and Barbara Bush, both hospitalized. Thank you for your wonderful letter!","Writing my inaugural address at the Winter White House, Mar-a-Lago, three weeks ago. Looking forward to Friday.… https://t.co/J0ojOXjrga",".@TheAlabamaBand was great last night in D.C. playing for 147 Diplomats and Ambassadors from countries around the world. Thanks Alabama!","No wonder the Today Show on biased @NBC is doing so badly compared to its glorious past. Little credibility!","\"Bayer AG has pledged to add U.S. jobs and investments after meeting with President-elect Donald Trump, the latest in a string...\" @WSJ","to the U.S., but had nothing to do with TRUMP, is more FAKE NEWS. Ask top CEO's of those companies for real facts. Came back because of me!","Totally biased @NBCNews went out of its way to say that the big announcement from Ford, G.M., Lockheed &amp; others that jobs are coming back...","Will be interviewed by @ainsleyearhardt on @foxandfriends - Enjoy!","RT @EricTrump: Thank you to @GolfDigest for this incredible feature! \"Golfer-in-Chief\" @RealDonaldTrump https://t.co/vpdY4jNbI4 https://t.c…","RT @MoskowitzEva: .@BetsyDeVos has the talent, commitment, and leadership capacity to revitalize our public schools and deliver the promise…","Thank you to General Motors and Walmart for starting the big jobs push back into the U.S.!","\"How Trump Won--And How The Media Missed It\" https://t.co/Hfab41h65X","\"thought it would be hypocritical to attend Bush's swearing-in....he doesn't believe Bush is the true elected president.\" Sound familiar! WP","John Lewis said about my inauguration, \"It will be the first one that I've missed.\" WRONG (or lie)! He boycotted Bush 43 also because he...","country and with the massive cost reductions I have negotiated on military purchases and more, I believe the people are seeing \"big stuff.\"","With all of the jobs I am bringing back into the U.S. (even before taking office), with all of the new auto plants coming back into our.....","The same people who did the phony election polls, and were so wrong, are now doing approval rating polls. They are rigged just like before.","People are pouring into Washington in record numbers. Bikers for Trump are on their way. It will be a great Thursday, Friday and Saturday!","\"@drgoodspine: @realDonaldTrump @Ivanka Trump is great, a woman with real character and class.\"","At 9:00 P.M. @CNN, of all places, is doing a Special Report on my daughter, Ivanka. Considering it is CNN, can't imagine it will be great!","\"@levisteveholt: @realDonaldTrump I appreciate your use of Twitter to keep us informed and maintain transparency.\" Very dishonest media!","Celebrate Martin Luther King Day and all of the many wonderful things that he stood for. Honor him for being the great man that he was!","much worse - just look at Syria (red line), Crimea, Ukraine and the build-up of Russian nukes. Not good! Was this the leaker of Fake News?",".@FoxNews \"Outgoing CIA Chief, John Brennan, blasts Pres-Elect Trump on Russia threat. Does not fully understand.\" Oh really, couldn't do...",".@NBCNews is bad but Saturday Night Live is the worst of NBC. Not funny, cast is terrible, always a complete hit job. Really bad television!","about that...Those Intelligence chiefs made a mistake here, &amp; when people make mistakes, they should APOLOGIZE.\" Media should also apologize","Thank you to Bob Woodward who said, \"That is a garbage document...it never should have been presented...Trump's right to be upset (angry)...","For many years our country has been divided, angry and untrusting. Many say it will never change, the hatred is too deep. IT WILL CHANGE!!!!","will only get higher. Car companies and others, if they want to do business in our country, have to start making things here again. WIN!","The Democrats are most angry that so many Obama Democrats voted for me. With all of the jobs I am bringing back to our Nation, that number..","Inauguration Day is turning out to be even bigger than expected. January 20th, Washington D.C. Have fun!","Congressman John Lewis should finally focus on the burning and crime infested inner-cities of the U.S. I can use all the help I can get!","INTELLIGENCE INSIDERS NOW CLAIM THE TRUMP DOSSIER IS \"A COMPLETE FRAUD!\"  @OANN","mention crime infested) rather than falsely complaining about the election results. All talk, talk, talk - no action or results. Sad!","Congressman John Lewis should spend more time on fixing and helping his district, which is in horrible shape and falling apart (not to......","A beautiful funeral today for a real NYC hero, Detective Steven McDonald. Our law enforcement community has my complete and total support.","The \"Unaffordable\" Care Act will soon be history!","have been allowed to run - guilty as hell. They were VERY nice to her. She lost because she campaigned in the wrong states - no enthusiasm!","What are Hillary Clinton's people complaining about with respect to the F.B.I. Based on the information they had she should never.....","released by \"Intelligence\" even knowing there is no proof, and never will be. My people will have a full report on hacking within 90 days!","Totally made up facts by sleazebag political operatives, both Democrats and Republicans - FAKE NEWS! Russia says nothing exists. Probably...","It now turns out that the phony allegations against me were put together by my political opponents and a failed spy afraid of being sued....","All of my Cabinet nominee are looking good and doing a great job. I want them to be themselves and express their own thoughts, not mine!","Congrats to the Senate for taking the first step to #RepealObamacare- now it's onto the House!",".@CNN is in a total meltdown with their FAKE NEWS because their ratings are tanking since election and their credibility will soon be gone!","Thank you to Linda Bean of L.L.Bean for your great support and courage. People will support you even more now. Buy L.L.Bean. @LBPerfectMaine","James Clapper called me yesterday to denounce the false and fictitious report that was illegally circulated. Made up, phony facts.Too bad!","\"@zhu_amy3: @realDonaldTrump It's Morning in America again!!!  ☀️☀️☀️Thank you President-Elect Donald Trump!!! So proud of you!!!!\" THANKS!","We had a great News Conference at Trump Tower today. A couple of FAKE NEWS organizations were there but the people truly get what's going on","Intelligence agencies should never have allowed this fake news to \"leak\" into the public. One last shot at me.Are we living in Nazi Germany?","I win an election easily, a great \"movement\" is verified, and crooked opponents try to belittle our victory with FAKE NEWS. A sorry state!","Russia has never tried to use leverage over me. I HAVE NOTHING TO DO WITH RUSSIA - NO DEALS, NO LOANS, NO NOTHING!","Russia just said the unverified report paid for by political opponents is \"A COMPLETE AND TOTAL FABRICATION, UTTER NONSENSE.\" Very unfair!","'BuzzFeed Runs Unverifiable Trump-Russia Claims' #FakeNews \nhttps://t.co/d6daCFZHNh","RT @MichaelCohen212: I have never been to Prague in my life. #fakenews https://t.co/CMil9Rha3D","FAKE NEWS - A TOTAL POLITICAL WITCH HUNT!","'Trump Helps Lift Small Business Confidence to 12-Yr. High'\nhttps://t.co/MhbABREhzt https://t.co/CWAvJ4fRdx","'Small business optimism soars after Trump election' https://t.co/WjBaTp824U","'U.S. Small-Business Optimism Index Surges by Most Since 1980'\nhttps://t.co/X22x1BttdG","Thank you to all of the men and women who protect &amp; serve our communities 24/7/365! \n#LawEnforcementAppreciationDay… https://t.co/aqUbDipSgv","An old picture with Nancy and Ronald Reagan. https://t.co/8kvQ1PzPAf","Ford said last week that it will expand in Michigan and U.S. instead of building a BILLION dollar plant in Mexico. Thank you Ford &amp; Fiat C!","It's finally happening - Fiat Chrysler just announced plans to invest $1BILLION in Michigan and Ohio plants, adding 2000 jobs. This after...","\"groveling\" when he totally changed a 16 year old story that he had written in order to make me look bad. Just more very dishonest media!","Hillary flunky who lost big. For the 100th time, I never \"mocked\" a disabled reporter (would never do that) but simply showed him.......","Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a.....","Rupert Murdoch is a great guy who likes me much better as a very successful candidate than he ever did as a very successful developer!","Dishonest media says Mexico won't be paying for the wall if they pay a little later so the wall can be built more quickly. Media is fake!","Before I, or anyone, saw the classified and/or highly confidential hacking intelligence report, it was leaked out to @NBCNews. So serious!","RT @MeetThePress: Watch our interview with @KellyannePolls: Russia \"did not succeed\" in attempts to sway election https://t.co/EZhgUIUbYx #…","Kellyanne Conway went to @MeetThePress this morning for an interview with @chucktodd. Dishonest media cut out 9 of her 10 minutes. Terrible!","\"@FoxNews: \"We certainly don’t want intelligence interfering with politics and we don’t want politics interfe… https://t.co/bwDjEg1d7S\"","\"@KellyannePolls: Welcome to President and Mrs. Bush.  \nhttps://t.co/I1K4nj1gVu\" Very nice!","I look very much forward to meeting Prime Minister Theresa May in Washington in the Spring. Britain, a longtime U.S. ally, is very special!","Congratulation to Jane Timken on her major upset victory in becoming the Ohio Republican Party Chair. Jane is a loyal Trump supporter &amp; star","both countries will, perhaps, work together to solve some of the many great and pressing problems and issues of the WORLD!","have enough problems around the world without yet another one. When I am President, Russia will respect us far more than they do now and....","Having a good relationship with Russia is a good thing, not a bad thing. Only \"stupid\" people, or fools, would think that it is bad! We.....","Only reason the hacking of the poorly defended DNC is discussed is that the loss by the Dems was so big that they are totally embarrassed!","Intelligence stated very strongly there was absolutely no evidence that hacking affected the election results. Voting machines not touched!","Gross negligence by the Democratic National Committee allowed hacking to take place.The Republican National Committee had strong defense!","Happy Birthday @EricTrump!\nhttps://t.co/bJaEY7qFSn","Monitoring the terrible situation in Florida. Just spoke to Governor Scott. Thoughts and prayers for all. Stay safe!","I am asking the chairs of the House and Senate committees to investigate top secret intelligence shared with NBC prior to me seeing it.","Anna Wintour came to my office at Trump Tower to ask me to meet with the editors of Conde Nast &amp; Steven Newhouse, a friend. Will go this AM.","being a movie star-and that was season 1 compared to season 14. Now compare him to my season 1. But who cares, he supported Kasich &amp; Hillary","Wow, the ratings are in and Arnold Schwarzenegger got \"swamped\" (or destroyed) by comparison to the ratings machine, DJT. So much for....","Hopefully, all supporters, and those who want to MAKE AMERICA GREAT AGAIN, will go to D.C. on January 20th. It will be a GREAT SHOW!","and knew they were in big trouble - which is why they cancelled their big fireworks at the last minute.THEY SAW A MOVEMENT LIKE NEVER BEFORE","Hillary and the Dems were never going to beat the PASSION of my voters. They saw what was happening in the last two weeks before the......","The dishonest media does not report that any money spent on building the Great Wall (for sake of speed), will be paid back by Mexico later!","So how and why are they so sure about hacking if they never even requested an examination of the computer servers? What is going on?","The Democratic National Committee would not allow the FBI to study or see its computer info after it was supposedly hacked by Russia......","How did NBC get \"an exclusive look into the top secret report he (Obama) was presented?\" Who gave them this report and why? Politics!","Toyota Motor said will build a new plant in Baja, Mexico, to build Corolla cars for U.S. NO WAY! Build plant in U.S. or pay big border tax.","to make up their own minds as to the truth. The media lies to make it look like I am against \"Intelligence\" when in fact I am a big fan!","The dishonest media likes saying that I am in Agreement with Julian Assange - wrong. I simply state what he states, it is for the people....","...time for Republicans &amp; Democrats to get together and come up with a healthcare plan that really works - much less expensive &amp; FAR BETTER!","...do the typical political thing and BLAME. The fact is ObamaCare was a lie from the beginning.\"Keep you doctor, keep your plan!\" It is....","The Democrats, lead by head clown Chuck Schumer, know how bad ObamaCare is and what a mess they are in. Instead of working to fix it, they..","Jackie Evancho's album sales have skyrocketed after announcing her Inauguration performance.Some people just don't understand the \"Movement\"","massive increases of ObamaCare will take place this year and Dems are to blame for the mess. It will fall of its own weight - be careful!","like the 116% hike in Arizona. Also, deductibles are so high that it is practically useless. Don't let the Schumer clowns out of this web...","Republicans must be careful in that the Dems own the failed ObamaCare disaster, with its poor coverage and massive premium increases......","things they did and said (like giving the questions to the debate to H). A total double standard! Media, as usual, gave them a pass.","Somebody hacked the DNC but why did they not have \"hacking defense\" like the RNC has and why have they not responded to the terrible......","Thank you to Ford for scrapping a new plant in Mexico and creating 700 new jobs in the U.S. This is just the beginning - much more to follow","\"@FoxNews: Julian Assange on U.S. media coverage: “It’s very dishonest.” #Hannity https://t.co/ADcPRQifH9\" More dishonest than anyone knows","Julian Assange said \"a 14 year old could have hacked Podesta\" - why was DNC so careless? Also said Russians did not give him the info!","The \"Intelligence\" briefing on so-called \"Russian hacking\" was delayed until Friday, perhaps more time needed to build a case. Very strange!","I will be having a general news conference on JANUARY ELEVENTH in N.Y.C. Thank you.","\"Trump is already delivering the jobs he promised America\" https://t.co/11spTMa6Tm","There should be no further releases from Gitmo. These are extremely dangerous people and should not be allowed back onto the battlefield.","Instead of driving jobs and wealth away, AMERICA will become the world's great magnet for INNOVATION &amp; JOB CREATION.\nhttps://t.co/siXrptsOrt","\"@DanScavino: Ford to scrap Mexico plant, invest in Michigan due to Trump policies\"\nhttps://t.co/137nUo03Gl","........may be, their number one act and priority. Focus on tax reform, healthcare and so many other things of far greater importance! #DTS","With all that Congress has to work on, do they really have to make the weakening of the Independent Ethics Watchdog, as unfair as it","The Democrat Governor.of Minnesota said \"The Affordable Care Act (ObamaCare) is no longer affordable!\" - And, it is lousy healthcare.","People must remember that ObamaCare just doesn't work, and it is not affordable - 116% increases (Arizona). Bill Clinton called it \"CRAZY\"","General Motors is sending Mexican made model of Chevy Cruze to U.S. car dealers-tax free across border. Make in U.S.A.or pay big border tax!","China has been taking out massive amounts of money &amp; wealth from the U.S. in totally one-sided trade, but won't help with North Korea. Nice!","North Korea just stated that it is in the final stages of developing a nuclear weapon capable of reaching parts of the U.S. It won't happen!","I thought and felt I would win big, easily over the fabled 270 (306). When they cancelled fireworks, they knew, and so did I.","Various media outlets and pundits say that I thought I was going to lose the election. Wrong, it all came together in the last week and.....","@CNN just released a book called \"Unprecedented\" which explores the 2016 race &amp; victory. Hope it does well but used worst cover photo of me!","Chicago murder rate is record setting - 4,331 shooting victims with 762 murders in 2016. If Mayor can't do it he must ask for Federal help!","Well, the New Year begins. We will, together, MAKE AMERICA GREAT AGAIN!","RT @IvankaTrump: 2016 has been one of the most eventful and exciting years of my life. I wish you peace, joy, love and laughter. Happy New…","RT @DonaldJTrumpJr: Happy new year everyone. #newyear #family #vacation #familytime https://t.co/u9fJIKNoZq","RT @EricTrump: 2016 was such an incredible year for our entire family! My beautiful wife @LaraLeaTrump made it even better! 🇺🇸🇺🇸 https://t.…","RT @Reince: Happy New Year + God's blessings to you all.  Looking forward to incredible things in 2017!  @realDonaldTrump will Make America…","RT @DanScavino: On behalf of our next #POTUS &amp; @TeamTrump-\n\n#HappyNewYear AMERICA🇺🇸\n\nhttps://t.co/Y6XDdijXea\nhttps://t.co/D8plL7xHql\nhttps:…","TO ALL AMERICANS-\n#HappyNewYear &amp; many blessings to you all! Looking forward to a wonderful &amp; prosperous 2017 as we… https://t.co/1asdMAL4iy"]